Tekla Open API Reference for Tekla Structures 2025
LinkAttributes Constructor
Overload List
Name | Description
LinkAttributes()
 Creates a new link attributes instance using standard attributes.
LinkAttributes(String)
 Creates a new link attributes instance loading the specified attributes.
Top
See Also
Reference
LinkAttributes Class
Tekla.Structures.Drawing Namespace